app/views/properties/show.html.erb

      <td><%= application.date_time %></td>
      <td><%= Property.find(application.property_id).name %></td>
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]