app/controllers/admins_controller.rb

  def show_leasing_agents
    @leasing_agents = LeasingAgent.all
---
SELECT "leasing_agents".* FROM "leasing_agents"

  def show_applicants
    @applicants = Applicant.all
---
SELECT "applicants".* FROM "applicants"

  def show_properties
    @properties = Property.all
---
SELECT "properties".* FROM "properties"

  def set_admin
    @admin = Admin.find(params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? ORDER BY "admins"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]