app/controllers/leasing_agents_controller.rb

  def getproperties
    #@properties = Property.all
    @properties = Property.where('leasing_agent_id = ?', current_leasing_agent.id)
---
SELECT "properties".* FROM "properties" WHERE (leasing_agent_id = NULL)

    def set_leasing_agent
      @leasing_agent = LeasingAgent.find(params[:id])
---
SELECT "leasing_agents".* FROM "leasing_agents" WHERE "leasing_agents"."id" = ? ORDER BY "leasing_agents"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]