app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @property = Property.find(params[:id])

INSERT INTO "properties" ("name", "address", "size", "features_pets", "features_laundry", "features_parking", "terms_available", "earliest_start_time", "application_fee", "monthly_rent", "occupied_by", "created_at", "updated_at", "leasing_agent_id", "availability") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    create_params = property_params
    if leasing_agent_signed_in?
    create_params[:leasing_agent_id] = current_leasing_agent.id
    end

    @property = Property.new(create_params)


    respond_to do |format|
      if @property.save

UPDATE "properties" SET "features_laundry" = ?, "updated_at" = ? WHERE "properties"."id" = ?  [["features_laundry", 1], ["updated_at", "2021-09-24 17:25:51.199503"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @property.update(property_params)